Revit 2027 API
Wall.GetAttachmentIds Method
 Gets the ids of the target elements that are attached to the Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAttachmentIds(
	AttachmentLocation attachmentLocation
)
Public Function GetAttachmentIds (
	attachmentLocation As AttachmentLocation
) As IList(Of ElementId)
public:
IList<ElementId^>^ GetAttachmentIds(
	AttachmentLocation attachmentLocation
)
member GetAttachmentIds :
        attachmentLocation : AttachmentLocation -> IList<ElementId>
Parameters
attachmentLocation AttachmentLocation
 The attachment location.
Return Value
IList<ElementId>
 Returns the elements ids that are attached to this wall at the specified "attachmentLocation".
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace